---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GroupAllowedViewTypes
source: html/3169ca36-3ec0-75f2-a9d4-1adeec3560dd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GroupAllowedViewTypes Property

"Allowed View Types"

## Syntax (C#)
```csharp
public static ForgeTypeId GroupAllowedViewTypes { get; }
```